app/controllers/users_controller.rb

  def index
    @users = User.all
---
SELECT "users".* FROM "users" ORDER BY "users"."created_at" DESC

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "email", "address", "contact", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "user1"], ["email", "user1@email.com"], ["address", "@user1"], ["contact", "111 22222"], ["created_at", "2022-12-01 10:59:14.728905"], ["updated_at", "2022-12-01 10:59:14.728905"]]

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "name" = ?, "email" = ?, "address" = ?, "contact" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "user81"], ["email", "user81@email.com"], ["address", "@user81"], ["contact", "8881 11111"], ["updated_at", "2022-12-05 05:59:39.654554"], ["id", 108]]